[
  {
    "type": "Designer",
    "title": "RTL Designer",
    "description": "We are looking for an RTL Design Engineer skilled in Verilog/System Verilog, with a strong foundation in digital design and microarchitecture. Experience with IP development, synthesis, and knowledge of protocols like Ethernet or PCIe is beneficial.",
    "experience": "3 to 15+ years",
    "location": "Office, Bangalore",
    "jobType": "Full Time",
    "postedDate": "25 Mar, 2024",
    "jobDescription": [
      "Strong experience in RTL coding using Verilog/System Verilog.",
      "Strong basics of digital design.",
      "Should be capable of defining the Microarchitecture specification from the High-Level Architecture spec.",
      "Should have done at least one IP development from scratch.",
      "Sound knowledge of front-end design tools and flows.",
      "Good experience in Synthesis, Lint, CDC, RDC, LEC.",
      "Knowledge of niche protocols such as Ethernet, PCIe, DDR, AMBA, etc. is a plus.",
      "Knowledge of Low power RTL design is an advantage.",
      "Good communication skills and a team player."
    ]
  },
  {
    "type": "Designer",
    "title": "Design Verification Engineer",
    "description": "We are in search of a Design Verification Engineer to build test benches using SV/UVM for IP and SoC verification. The role requires expertise in verification planning, debugging, and familiarity with protocols like PCIe, CXL, and DDR.",
    "experience": "3 to 15+ years",
    "location": "Office, Bangalore",
    "jobType": "Full Time",
    "postedDate": "25 Mar, 2024",
    "jobDescription": [
      "Strong experience in test bench development using industry-standard HVLs and methodologies such as SV/UVM.",
      "Strong digital design basics and debug skills.",
      "Defining the verification plan and test bench architecture from scratch.",
      "Test bench development experience using SV/UVM.",
      "Experience in IP level and SoC level verification.",
      "Constraint random verification, assertion-based verification, quality checks such as Functional and Code coverage.",
      "Knowledge of niche protocols such as Ethernet, PCIe, CXL, DDR, USB, AMBA protocols is a plus.",
      "SV and C/C++ based test bench experience is an added advantage.",
      "Experience in industry-standard simulation tools.",
      "Any scripting knowledge such as Perl, Python is a plus."
    ]
  },
  {
    "type": "Designer",
    "title": "Physical Design Engineer",
    "description": "We are hiring a Physical Design Engineer to perform tasks such as floorplanning, clock tree synthesis, and routing for complex ASICs. The role focuses on optimizing designs for performance, power, and area (PPA) while working closely with other teams.",
    "experience": "3 to 15+ years",
    "location": "Office, Bangalore",
    "jobType": "Full Time",
    "postedDate": "25 Mar, 2024",
    "jobDescription": [
      "Perform physical design tasks including floorplanning, placement, clock tree synthesis (CTS), routing, and physical verification.",
      "Optimize designs for performance, power, and area (PPA).",
      "Conduct timing closure and signal integrity analysis.",
      "Work on advanced process nodes (e.g., 7nm, 5nm, 3nm) to implement complex designs.",
      "Collaborate with RTL design engineers to resolve design and implementation issues.",
      "Utilize industry-standard EDA tools (e.g., Cadence, Synopsys, Mentor Graphics) for physical design.",
      "Perform design rule checks (DRC) and layout versus schematic (LVS) checks.",
      "Contribute to the development and maintenance of design methodologies and flows.",
      "Participate in the tapeout process and ensure the timely delivery of high-quality designs.",
      "Debug and resolve post-silicon issues related to physical design.",
      "Experience with low-power design techniques and methodologies.",
      "Familiarity with high-speed interface design.",
      "Knowledge of packaging and signal integrity issues.",
      "Understanding of process technology and its impact on physical design."
    ]
  },
  {
    "type": "Engineer",
    "title": "STA Engineer",
    "description": "We need an STA Engineer to carry out static timing analysis at both block and full-chip levels. The role involves resolving timing violations and optimizing design performance using industry-standard tools.",
    "experience": "3 to 15+ years",
    "location": "Office, Bangalore",
    "jobType": "Full Time",
    "postedDate": "25 Mar, 2024",
    "jobDescription": [
      "Perform static timing analysis on digital designs to ensure timing closure.",
      "Develop and validate timing constraints (SDC) for different modes and corners.",
      "Work on timing verification for different stages of the design flow, including RTL, synthesis, and place-and-route (PnR).",
      "Identify and resolve timing violations, collaborating with RTL and physical design teams to implement necessary changes.",
      "Optimize designs for performance, power, and area (PPA).",
      "Conduct clock domain crossing (CDC) analysis and ensure proper synchronization.",
      "Use industry-standard STA tools (e.g., Synopsys PrimeTime, Cadence Tempus).",
      "Analyze and mitigate on-chip variation (OCV) and multi-mode multi-corner (MMMC) timing issues.",
      "Perform signal integrity analysis, including noise and crosstalk analysis.",
      "Provide feedback and guidance on design methodologies to improve timing closure efficiency.",
      "Document timing analysis results and contribute to design reviews.",
      "Experience with low-power design techniques and methodologies.",
      "Familiarity with signal integrity and power integrity analysis.",
      "Understanding of physical design flow and its impact on timing.",
      "Knowledge of clock tree synthesis (CTS) and its timing implications."
    ]
  },
  {
    "type": "Engineer",
    "title": "DFT Engineer",
    "description": "We are seeking a DFT Engineer experienced in scan insertion, ATPG, and pattern generation. Strong knowledge of fault simulations, MBIST, and JTAG tools is essential for this role.",
    "experience": "4 to 15+ years",
    "location": "Office, Bangalore",
    "jobType": "Full Time",
    "postedDate": "25 Mar, 2024",
    "jobDescription": [
      "Strong digital design basics.",
      "Strong knowledge of DFT architecture.",
      "Strong experience in one or more of the following (and not limited to):",
      "Hands-on experience in Scan Insertion, ATPG, Scan Verification and Pattern Generation, Fault Simulations.",
      "MBIST insertion, validation, and pattern generation, Fault Simulations.",
      "JTAG Standard (BSCAN, IEEE 1149.1).",
      "Functional pattern generation, pattern debug on ATE (Getting ATE Pass).",
      "Design verification of DFT IP, JTAG, Clock, etc.",
      "Create and maintain DFT timing constraints.",
      "Experience in industry-standard DFT tools.",
      "Any scripting knowledge such as Perl, Python is a plus."
    ]
  },
  {
    "type": "Engineer",
    "title": "Analog Circuit Design Engineer",
    "description": "We are looking for an Analog Circuit Design Engineer to design and simulate CMOS circuits, with a focus on power management or high-speed interfaces. Hands-on experience with Cadence tools and low-power design techniques is a plus.",
    "experience": "3 to 6 years",
    "location": "Office, Bangalore",
    "jobType": "Full Time",
    "postedDate": "25 Mar, 2024",
    "jobDescription": [
      "Design, develop, and simulate Analog Circuit Systems.",
      "Strong fundamentals of CMOS circuits and design.",
      "Minimum 4 years of experience in Circuit Design.",
      "Experience in Power Management, including hands-on experience with DC-DC Converters, Precision Analog Circuits like OP-AMP, Band-gap references, POR, Current Limit circuits, LDO Regulators, Comparators, Oscillators, CDR, PLL, etc.",
      "Experience in high-speed interfaces such as SerDes (Tx & Rx), DDR, HBM, PCIe, USB, etc.",
      "Exposure to both top-level and block-level design and simulation. Scratch-up design experience is a plus.",
      "Proven skills in designing and understanding blocks like Transmitter, Receiver, Clocking.",
      "Hands-on knowledge of Signal Analysis and Frequency compensation techniques.",
      "Top-level integration, block-level verification.",
      "Hands-on working with tools – Cadence/Synopsys/Siemens for Schematic/Model design & verification.",
      "Low Power Design experience is an added advantage.",
      "Collaborate closely with the Analog Layout Engineer to get optimized IP layout.",
      "Good team player with strong communication skills."
    ]
  },
  {
    "type": "Engineer",
    "title": "Embedded Test Engineer",
    "description": "We are searching for an Embedded Test Engineer to execute and automate black box and white box testing for WLAN protocols. The role requires working with development teams to debug and set up lab hardware.",
    "experience": "3 to 10 years",
    "location": "Office, Bangalore",
    "jobType": "Full Time",
    "postedDate": "25 Mar, 2024",
    "jobDescription": [
      "The role of a WLAN Test/ BT Test Generic/ BT Dev Generic/ Video Test/ Display Test/ Camera Test/ Audio Test/ APT Test Generic Engineer is to work on a wide variety of tasks covering the full spectrum of black box and white box testing.",
      "Responsibilities include executing test plans, managing, and updating lab hardware setups.",
      "Contribute to test execution and test automation.",
      "Work with development teams to reproduce and debug issues reported by engineering test teams, T&V teams, and customers.",
      "Be a member of an Agile cross-functional scrum team, participating in Sprint planning, reviews, and retrospectives.",
      "Create relevant documents following the processes.",
      "Minimum qualifications: 2-8 years of 802.11 protocol testing and manual experience.",
      "Bachelor’s degree in Computer Science, Computer Engineering, or similar fields.",
      "Excellent knowledge of IEEE 802.11 WLAN protocols and standards (802.11a, b, g, n, ac, ax, d, h, I, k, v, r).",
      "Experience with wireless trace tools (Omnipeek, Wireshark) and managing network infrastructure and WLAN devices like Access Points and Switches.",
      "Experience configuring, testing, and troubleshooting networking technologies and WLAN security protocols (802.1x, AES/CCMP, etc.).",
      "Strong problem-solving ability and debugging skills for diagnosing complex system issues.",
      "Experience in Automation Framework (RFS) and scripting languages like Python is desirable.",
      "Exposure to Android is an added advantage.",
      "Ability to work in a fast-paced environment and be a good team player.",
      "Excellent communication skills.",
      "802.11 protocol testing experience is essential."
    ]
  }
]
